treysiz/esp32-printer-client/sdkconfig.defaults
# ESP32 Printer Client - SDK Configuration Defaults
# For ESP-IDF v5.x / ESP32-S3
# These are applied automatically at build time if sdkconfig does not exist.

# ── Target ──────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ── WiFi ────────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE_DYNAMIC=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# ── TCP/IP Stack (LwIP) ──────────────────────────────────────────────────
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5744
CONFIG_LWIP_TCP_WND_DEFAULT=5744
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072

# ── HTTPS / TLS (backend "WiFi 拉单") ────────────────────────────────────
# Bundle of common root CAs so https:// backend URLs validate out of the box.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# ── SPI RAM (PSRAM) — OPTIONAL ───────────────────────────────────────────
# The code (big_malloc) automatically uses PSRAM for the HTTP response +
# decoded receipt buffers when present, and falls back to internal RAM
# otherwise. The 48 KB default buffer fits internal RAM on the ESP32-S3, so
# PSRAM is only needed for very large 80mm receipts. If your module HAS PSRAM,
# enable it below — but pick the MODE that matches your module (QUAD vs OCT),
# as a wrong mode can stop the board from booting:
#   CONFIG_SPIRAM=y
#   CONFIG_SPIRAM_USE_MALLOC=y
#   # then EITHER (most N8R8/N16R8 octal modules):
#   #   CONFIG_SPIRAM_MODE_OCT=y
#   # OR (quad-PSRAM modules):
#   #   CONFIG_SPIRAM_MODE_QUAD=y

# ── NVS ─────────────────────────────────────────────────────────────────
CONFIG_NVS_ENCRYPTION=n

# ── FreeRTOS ─────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# ── Logging ──────────────────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# ── Heap / Memory ────────────────────────────────────────────────────────
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_5=y

# ── Partition table ──────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ── ESP-NETIF ────────────────────────────────────────────────────────────
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
